# SwinV2 + YOLOv8 Full Neck & Head

# Anzahl Klassen
nc: 27

scales:
  s: [0.33, 0.50, 1024]

backbone:
  - [-1, 1, SwinTransformerV2, ["swin_small", True]]       # gibt [P3=192, P4=384, P5=768] zurück
  - [0, 1, Index, [192, 1]]              # P3
  - [0, 1, Index, [384, 2]]              # P4
  - [0, 1, Index, [768, 3]]              # P5
  - [-1, 1, SPPF, [1536, 5]]             # 4 → optional SPPF nach P5

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # -> upsample 1024 to 512?
  - [[-1, 2], 1, Concat, [1]]            # concat upsample + P4 (384)
  - [-1, 3, C2f, [768]]                  # output C = 512

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]]            # concat + P3 (192)
  - [-1, 3, C2f, [384]]                  # P3 (small)

  - [-1, 1, Conv, [384, 3, 2]]           # downsample
  - [[-1, 6], 1, Concat, [1]]            # concat with P4 output
  - [-1, 3, C2f, [768]]                  # P4 (medium)

  - [-1, 1, Conv, [768, 3, 2]]
  - [[-1, 4], 1, Concat, [1]]            # concat with P5
  - [-1, 3, C2f, [10215364]]                 # P5 (large)

  - [[10, 13, 16], 1, Detect, [nc]]
