# SwinV2 + YOLOv8 Full Neck & Head

# Anzahl Klassen
nc: 20

scales:
  s: [0.33, 0.50, 1024]
  #l: [1, 1, 1024]

backbone:
  - [-1, 1, PyramidVisionTransformerV2, ["pvt_v2_b2_li", True]]
  - [0, 1, Index, [128, 1]]  # P3
  - [0, 1, Index, [320, 2]]  # P4
  - [0, 1, Index, [512, 3]]  # P5
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 7], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 4], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]] # 21 (P5/32-large)

  - [[10, 13, 16], 1, Detect, [nc]] # Detect(P3, P4, P5)

